package com.example.myapplication.DATA;

public class DataObject {

// ID Предметов
    public static int[] ID = new int[] {
            1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13
    };

// Названия предметов
    public static String[] nameObj = new String[] {
            "Разработка МП на Java (доп)", "Мат. Анализ", "Алгебра и геометрия", "ОО программирование",
            "Ознакомительная практика", "Физика", "Структуры и АОД", "Ин. Язык", "Физика (доп)", "Мат. логика и ТА",
            "Правоведение", "Tesla", "Разработка МП на Java"
    };

// Преподаватели
    public static String[] teacherObj = new String[] {
            "Шешуков Леонид Сергеевич", "Белова Ирина Михайловна", "Таланова Людмила Ивановна ",
            "Грач Евгений Петрович", "Лисицын Тарас Анатольевич", "Ильин Никита Александрович", "Сыромятников Владислав Петрович",
            "Богуш Надежда Борисовна ", "Сафронов Александр Аркадьевич ", "Дзержинский Роман Игоревич", "Милкина Екатерина Валерьевна", "Tesla", "Разработка МП на Java"
    };

// Количество проведенных лекций/семинаров
    public static int[] infoNow = new int[] {
            12, 13, 15, 5, 0, 23, 4, 12, 13, 15, 5, 0, 23
    };

// Общее количество лекций/семинаров для предмета
    public static int[] infoAll = new int[] {
            18, 14, 12, 5, 15, 34, 4, 18, 14, 12, 5, 15, 34
    };

// Доступ к выбранному предмету
    public static boolean[] acsess = new boolean[] {
            true, false, false, false, false, false, false, false, false, false, false, false, false
    };


}
