package com.example.myapplication.DATA;

public class DataLecture {

// Название лекции/семинара
    public static String[] title = new String[] {
            "Модуль 1", "Модуль 2", "Модуль 3", "Модуль 4", "Модуль 5"
    };

// Описание лекции/семинара
    public static String[] info = new String[] {
            "Линейные пространства. Определение линейного пространства. Примеры линейных пространств. Линейные пространства геометрических векторов на плоскости и в пространстве...",
            "Линейные пространства. Определение линейного пространства. Примеры линейных пространств. Линейные пространства геометрических векторов на плоскости и в пространстве...",
            "Линейные пространства. Определение линейного пространства. Примеры линейных пространств. Линейные пространства геометрических векторов на плоскости и в пространстве...",
            "Линейные пространства. Определение линейного пространства. Примеры линейных пространств. Линейные пространства геометрических векторов на плоскости и в пространстве...",
            "Линейные пространства. Определение линейного пространства. Примеры линейных пространств. Линейные пространства геометрических векторов на плоскости и в пространстве..."
    };

// Доступ к лекции семинару
public static boolean[] access = new boolean[] {
        false, true, true, true, true
};


}
